import numpy as np

# 创建向量
arr1 = np.arange( 1, 10 )  # 1,2,3,4,5,6,7,8,9

# 访问元素
print( arr1[3] )        # 4
print( arr1[-1] )       # 9

# 修改元素
arr1[3] = 100

# 创建矩阵
arr2 = np.array( [ [1,2,3],[4,5,6] ] )

# 访问元素
print( arr2[0,2] )
print( arr2[1,-2] )

# 修改元素
arr2[1,1] = 100.9

# 创建向量
arr3 = np.arange(0,90,10)  # [ 0 10 20 30 40 50 60 70 80 ]

# 花式索引
print( arr3[ [0,2] ] )      # 返回[0,20]

# 创建矩阵
arr4 = np.arange(1,17).reshape(4,4)

# 花式索引（用向量替代普通索引的行列元素，且花式索引输出仍是一个向量）
print( arr4[ [0,1] , [0,1] ] )  # 返回(0,0)和(1,1)元素  [1 6]
print( arr4[ [0,1,2] , [2,1,0] ] )  # 返回(0,2)、(1,1)和(2,0)  [3 6 9]

# 修改元素
arr4[ [0,1,2,3] , [3,2,1,0] ] = 100    # 将这四个元素值改为100

# 向量切片
arr5 = np.arange(10)
print( arr5 )              # [0 1 2 3 4 5 6 7 8 9]
print( arr5[1:4] )         # [1 2 3]  从索引[1]开始，切到索引[4]之前
print( arr5[1: ] )         # [1 2 3 4 5 6 7 8 9]  从索引[1]开始，切到结尾
print( arr5[ :4] )         # [0 1 2 3]  从数组开头开始，切到索引[4]之前

print( arr5[2:-2] )        # [2 3 4 5 6 7] 从索引[2]开始，切到索引[-2]之前
print( arr5[ :-2] )        # [0 1 2 3 4 5 6 7]  从数组开头开始，切到索引[-2]之前

print( arr5[ : :3] )       # [0 3 6 9]  每3个元素采样一次
print( arr5[1:-1:2] )      # [1 3 5 7]  从索引[1]开始，切到索引[-1]，每2个元素采样一次

# 矩阵切片
arr6 = np.arange(1,21).reshape(4, -1)
print( arr6 )
print( arr6[1:3,1:-1] )     # 区间采样，从第1行之后到第3行，从第1列之后到倒数第1列之前
print( arr6[1::2, ::3] )    # 跳跃采样，从第2行开始，每2行取一次；从第0列开始，每3列取一次

# 提取矩阵的行
print( arr6[2,:] )          # 提取第2行
print( arr6[1:3,:] )        # 提取1至2行

# 提取矩阵的列
print( arr6[:,2] )          # 提取第2列（输出的是向量）
print( arr6[:,1:3] )        # 提取1至2行

# 得到矩阵的列
cut = arr6[:,2]             # 提取第2列为向量
#--
cut = cut.reshape( (-1,1) ) # 直接升级成列矩阵
#--
cut = cut.reshape( (1,-1) ) # 升级成矩阵
print( cut.T )              # 转置操作
#--

# 对切片数据进行修改，原数组也被修改

# 备份切片为新变量
copy = arr6[ :3].copy()
copy[0] = 100       # 不会修改原数组
