import numpy as np

# 创建一维数组--向量
arr1 = np.array([1, 2, 3])

# 创建二维数组--行矩阵
arr2 = np.array([[1, 2, 3]])

# 创建二维数组--列矩阵
arr3 = np.array([[1], [2], [3]])

# 创建二维数组--矩阵
arr4 = np.array([[1, 2, 3], [4, 5, 6]])

# 递增数组1
arr5 = np.arange(10)        # 从0开始，到10之前结束

# 递增数组2
arr6 = np.arange(10, 20)    # 从10开始，到20之前结束

# 递增数组3
arr7 = np.arange(1, 21, 2)  # 从1开始，到21之前结束，步长为2

# 全0数组
arr8 = np.zeros( (1,3) )    # 形状为3的向量 [[0. 0. 0.]]

# 全1数组
arr9 = np.ones(3)           #形状为(1,3)的矩阵 [[1. 1. 1.]]

# 全3.14数组
arr10 = 3.14 * np.ones( (2,3) )  # 形状为(2,3)的矩阵

# 0-1均匀分布的浮点型随机数组
arr11 = np.random.random( 5 )    # 形状为5的向量

# 60-100均匀分布
arr12 = (100-60) * np.random.random( (2,3) ) + 60

# 整数型随机数组
arr13 = np.random.randint( 10, 100, (1,15) )  # 范围10~100，形状为(1,15)的矩阵

# 服从正态分布的随机数组
arr14 = np.random.normal( 0, 1, (2,3) )  # 形状为(2,3)的二维矩阵
arr15 = np.random.randn( (2,3) )    # 标准正态分布
